## Pandas
* Pandas is a Python library used for working with data sets
* It has functions for analyzing, cleaning, exploring, and manipulating data
* The name "Pandas" has a reference to both "Panel Data" and "Python Data Analysis"

In [1]:
# importing pandas
import pandas as pd

## Series
 One Dimentional array with axis labels (like a single column of a 2D-array / DataFrame)
## Dataframe
 2D array with axis labels (row and column) (containing multiple Series)

In [2]:
# Creating Series
sr = pd.Series([45, 656, 567, 5, 67, 6])
sr = pd.Series({'first': 1, 'second': 2, 'third': 3})   # The keys of the dictionary become the labels of the rows
sr = pd.Series([45, 656, 567, 5], index=['first', 'second', 3, 'forth'])

## Index & Columns
* **index**   : labels of rows    (default : 0, 1, 2, ...)
* **columns** : labels of columns (default : 0, 1, 2, ...)

In [3]:
# Creating Dataframes
data = {"calories": [420, 380, 390], "duration": [50, 40, 45]}
marks = [
    ['Nayeem', 86],
    ['Sami', 63],
    ['Alif', 53],
]
df = pd.DataFrame(data) # The keys of the dictionary become the label of the columns
df = pd.DataFrame(data, index=['first', 'second', 'third'])
df = pd.DataFrame(marks, columns=['Name', 'Marks'])
df = pd.DataFrame(marks, index=['first', 'second', 'third'], columns=['Name', 'Marks'])

df

          Name  Marks
first   Nayeem     86
second    Sami     63
third     Alif     53

## Read & Write to a file

In [4]:
# Write CSV

df.to_csv('data\\marks_data1.csv')
# changing csv separator, removing index/row labels, removing headers/column names:
df.to_csv('data\\marks_data2.tsv', sep='\t', index=False, header=None)
# tsv -> tab separated values (\t)

# save only selected columns:
df.to_csv('data\\marks_data3.csv', columns=['Marks']) 


# Read CSV
pokemons = pd.read_csv('data\\Pokemon.csv')

# if that has a different separator and don't have headers + (setting custom header):
df2 = pd.read_csv('data\\marks_data2.tsv', sep='\t', header=None, names=['name', 'mark'])

df2 = pd.read_csv('data\\Pokemon.csv', skiprows=4) # skip first 4 rows
df2 = pd.read_csv('data\\Pokemon.csv', nrows=5) # read only first 5 rows

df2

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [5]:
# Almost most of the things are same with CSV read write
# Write Exel
df.to_excel('data\\marks_data1.xlsx')

# set sheet name and define offset
df.to_excel('data\\marks_data2.xlsx', sheet_name='Sheet1', startcol=1, startrow=2)

# Read Exel
df = pd.read_excel('data\\marks_data1.xlsx', 'Sheet1')

# save in multiple sheets
# mode='a' : if writing in existing file
with pd.ExcelWriter('data\\marks_data3.xlsx') as writer:
     df.to_excel(writer, sheet_name='SheetA')
     pokemons.to_excel(writer, sheet_name='SheetB')

## Basics

In [6]:
data = {
    'name': ['Alif', 'Sami', 'Asma', 'Faruk'],
    'roll': [256, 249, 269, 215],
    'mark': [38, 69, 55, 72],
    'passed': [False, True, True, True],
}
df = pd.DataFrame(data)
df

    name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True

In [7]:
# printing the whole DataFrame
print(df)
print(df.to_string())

print(df.head()) # returns first 5 rows
print(df.head(4)) # returns first 4 rows

print(df.tail()) # returns last 5 rows
print(df.tail(6)) # returns last 6 rows

print(df.info())  # print the basic info like: columns, dtype, count, memory usage etc.
print(df.describe()) # print count, mean, std, min, 25%, 50%, 75%, max

print(df.index)  # print all index
print(df.columns) # print all columns
print(df.shape) # print shape

name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True
    name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True
    name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True
    name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True
    name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True
    name  roll  mark  passed
0   Alif   256    38   False
1   Sami   249    69    True
2   Asma   269    55    True
3  Faruk   215    72    True
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   roll    4 non-null      int64
 2   mark    4 non-null      int64
 3   passed  4 non-null      bool
dtypes: bool(1), int64(2), object(1)
memory usage: 148.0+ bytes
None
             roll       mark
count    4.000000   4.000000
mean   247.250000  58.500000
std     23.041629  15.545632
min    215.000000  38.000000
25%    240.500000  50.750000
50%    252.500000  62.000000
75%    259.250000  69.750000
max    269.000000  72.000000
RangeIndex(start=0, stop=4, step=1)
Index(['name', 'roll', 'mark', 'passed'], dtype='object')
(4, 4)

In [8]:
df.roll    # get the roll column
df['roll'] # get the roll column
df[['roll', 'mark']] # get the roll & marks column

   roll  mark
0   256    38
1   249    69
2   269    55
3   215    72

In [9]:
# Copy vs View
newdf = df # this will create a view. 'newdf' will point to 'df'
newdf = df.copy() # this will be a copy. Now, 'newdf' and 'df' is fully apart
# most of the functions like: drop, loc, iloc, reset_index returns a copy
# If you want to do something to the orginial dataframe, pass this : inplace=True



# Accesing and modifying DataFrame
# print(df['mark']) # returns that column (a Series)
# print(df['mark'][4]) # returns element on index 4 in 'marks'

# setting element this way sholud be ignored
# df['mark'][4] = 83

In [10]:
# loc
print(df.loc[2, 'mark'])   # 2 : index  | 'mark' : column
df.loc[2, 'mark'] = 45 # if any given value of index or column is not found, it will create a new one

# selecting a range
print(df.loc[[0, 1, 3,], ['roll', 'mark']]) # return elements of 0, 1, 3, 5 index from 'roll', 'mark' columns
print(df.loc[:, ['mark']])        # return elements of all index from 'mark' column
print(df.loc[[0, 2], :])          # return elements of 0 to 2 index from all columns
print(df.loc[1:3, 'name':'mark']) # return elements of 1 to 3 index from 'name' to 'mark' columns

# iloc
# same as loc, just here we need to pass exact index/column, not the label
print(df.iloc[3, 2])
df.iloc[3, 2] = 45
print(df.iloc[:, [1, 2]])

# df.<loc|iloc>[<index|list_of_index|range_of_index>, <column|list_of_column|range_of_column>]

# conditional loc/iloc (query)
df.loc[df['mark'] > 75]
df.loc[(df['mark'] > 75) & (df['roll'] < 320)]

55
   roll  mark
0   256    38
1   249    69
3   215    72
   mark
0    38
1    69
2    45
3    72
   name  roll  mark  passed
0  Alif   256    38   False
2  Asma   269    45    True
    name  roll  mark
1   Sami   249    69
2   Asma   269    45
3  Faruk   215    72
72
   roll  mark
0   256    38
1   249    69
2   269    45
3   215    45

Empty DataFrame
Columns: [name, roll, mark, passed]
Index: []

In [11]:
# changing index with a column
newdf = df.set_index('roll')
newdf

       name  mark  passed
roll
256    Alif    38   False
249    Sami    69    True
269    Asma    45    True
215   Faruk    45    True

In [12]:
# reseting index
newdf = newdf.reset_index()
newdf

   roll   name  mark  passed
0   256   Alif    38   False
1   249   Sami    69    True
2   269   Asma    45    True
3   215  Faruk    45    True

In [13]:
# Drop (delete)
newdf = df.drop(2) # default axis = 0 | # delete index 2 (3 no. row) 
newdf = df.drop('roll', axis=1) # delete 'roll' column
newdf = df.drop(['roll', 'name'], axis=1) # delete 'roll' and 'name' column

# After dropping or anything, the index/column can get messy, to reset that
newdf2 = newdf.reset_index() # this will not drop the previous index, it will name that a new column
newdf2 = newdf.reset_index(drop=True)

In [14]:
# Some functions
x = df["mark"].max()
x = df["mark"].min()
x = df["mark"].mean()
x = df["mark"].median()
x = df["mark"].std()
x = df["mark"].mode()[0]

# Get Value Counts
mark_counts = df["mark"].value_counts() # count all value without null
mark_counts = df["mark"].value_counts(dropna=False) # count all value

# Column rename:
newdf = df.rename(columns = {'roll': 'roll_number', 'mark': 'result'}, inplace=False)
# inplace = True : means it will change the orginial dataframe

## Other

In [15]:
# Pandas Correlations (Finding Relationships)
data = [
    ['Nayeem', 301, 86, 73,   96],
    ['Masuda', 302, 75, 71,   76],
    ['Someone',305, 84, 73,   96],
    ['Kawser', 308, 83, 79,   94],
    ['Lamima', 303, 75, 81,   77],
]
df = pd.DataFrame(data, columns=['name', 'roll', 'bangla', 'english', 'math'])
df.corr()
# this represent increment/decrement ratio with two rows taht is -1 to 1
# 1 or close to it means a good relationship
# -1 or it's close means a good relationship but the opposite (if one increase, other one decrease)
# 0.2, -0.35 ... these are not good relationship

#              roll    bangla   english      math
# roll     1.000000  0.234505  0.465440  0.372427
# bangla   0.234505  1.000000 -0.211876  0.987103
# english  0.465440 -0.211876  1.000000 -0.142562
# math     0.372427  0.987103 -0.142562  1.000000

# We ca see a good relationship in bangla and math
# the centre 1.000 is for roll increse same with roll, because roll is same to roll
# other values determeans relationships, like: roll * english --> 0.465440
# this means, if roll is increased, 46.5440% chance to increase english number

             roll    bangla   english      math
roll     1.000000  0.234505  0.465440  0.372427
bangla   0.234505  1.000000 -0.211876  0.987103
english  0.465440 -0.211876  1.000000 -0.142562
math     0.372427  0.987103 -0.142562  1.000000

## Cleaning Data

In [16]:
df = pd.read_excel("data\\missing_data.xlsx", parse_dates=['day'])
df.set_index('day', inplace=True) # setting day column as index
df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [17]:
new_df = df.fillna(0) # replacing all NaN with 0
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          0.0        9.0   Sunny
2017-01-05         28.0        0.0    Snow
2017-01-06          0.0        7.0       0
2017-01-07         32.0        0.0    Rain
2017-01-08          0.0        0.0   Sunny
2017-01-09          0.0        0.0       0
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [18]:
# filling NaN in different columns
new_df = df.fillna({
    'temperature': 0,
    'windspeed': 0,
    'event': 'no event',
})
new_df

            temperature  windspeed     event
day
2017-01-01         32.0        6.0      Rain
2017-01-04          0.0        9.0     Sunny
2017-01-05         28.0        0.0      Snow
2017-01-06          0.0        7.0  no event
2017-01-07         32.0        0.0      Rain
2017-01-08          0.0        0.0     Sunny
2017-01-09          0.0        0.0  no event
2017-01-10         34.0        8.0    Cloudy
2017-01-11         40.0       12.0     Sunny

In [19]:
# back fill. fill NaN with the next value on given axis
new_df = df.fillna(method='bfill')
print(new_df)
new_df = df.fillna(method='bfill', axis=1)
print(new_df)

temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         28.0        9.0   Sunny
2017-01-05         28.0        7.0    Snow
2017-01-06         32.0        7.0    Rain
2017-01-07         32.0        8.0    Rain
2017-01-08         34.0        8.0   Sunny
2017-01-09         34.0        8.0  Cloudy
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny
           temperature windspeed   event
day
2017-01-01        32.0       6.0    Rain
2017-01-04         9.0       9.0   Sunny
2017-01-05        28.0      Snow    Snow
2017-01-06         7.0       7.0     NaN
2017-01-07        32.0      Rain    Rain
2017-01-08       Sunny     Sunny   Sunny
2017-01-09         NaN       NaN     NaN
2017-01-10        34.0       8.0  Cloudy
2017-01-11        40.0      12.0   Sunny

In [20]:
# forward fill. fill NaN with the previous value on given axis
new_df = df.fillna(method='ffill')
print(new_df)
new_df = df.fillna(method='ffill', axis=1)
print(new_df)

temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        9.0   Sunny
2017-01-05         28.0        9.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         32.0        7.0   Sunny
2017-01-09         32.0        7.0   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny
           temperature windspeed   event
day
2017-01-01        32.0       6.0    Rain
2017-01-04         NaN       9.0   Sunny
2017-01-05        28.0      28.0    Snow
2017-01-06         NaN       7.0     7.0
2017-01-07        32.0      32.0    Rain
2017-01-08         NaN       NaN   Sunny
2017-01-09         NaN       NaN     NaN
2017-01-10        34.0       8.0  Cloudy
2017-01-11        40.0      12.0   Sunny

In [21]:
# limiting bfill / ffill
new_df = df.fillna(method='ffill', limit=2)
print(new_df)

temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        9.0   Sunny
2017-01-05         28.0        9.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         32.0        7.0   Sunny
2017-01-09         32.0        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [22]:
# interpolate
new_df = df.interpolate() # linear interpolate
print(new_df)
new_df = df.interpolate(method='time') # it will look for time difference
print(new_df)

temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    30.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny
            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    29.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [23]:
# drop NaN
new_df = df.dropna()  # at least one NaN
print(new_df)
new_df = df.dropna(how='all') # only if all values are NaN
print(new_df)

temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny
            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [24]:
new_df = df.dropna(thresh=2) # keep the row, if it has at least 2 non-NaN value
print(new_df)

temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-07         32.0        NaN    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [25]:
# inserting missing date
dt = pd.date_range('2017-01-01', '2017-01-11')
idx = pd.DatetimeIndex(dt)
new_df = df.reindex(idx)
new_df

            temperature  windspeed   event
2017-01-01         32.0        6.0    Rain
2017-01-02          NaN        NaN     NaN
2017-01-03          NaN        NaN     NaN
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [26]:
df = pd.read_excel("data\\missing_data2.xlsx")
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          9  Sunny
2 2017-01-03           28     -88888   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -88888   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [27]:
import numpy as np
new_df = df.replace(-99999, np.NaN)
print(new_df, '\n')
new_df = df.replace([-99999, -88888], np.NaN)
print(new_df)

day  temperature  windspeed  event
0 2017-01-01         32.0          6   Rain
1 2017-01-02          NaN          9  Sunny
2 2017-01-03         28.0     -88888   Snow
3 2017-01-04          NaN          7      0
4 2017-01-05         32.0     -88888   Rain
5 2017-01-06         31.0          2  Sunny
6 2017-01-06         34.0          5      0

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        9.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0      0
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [28]:
# replacing based on column
new_df = df.replace({
    'temperature': -99999,
    'windspeed': -88888,
    'event': 0,
}, np.NaN)
print(new_df)

day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        9.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [29]:
# replacing based on string
new_df = df.replace({
    -99999: np.NaN,
    -88888: 0,
})
print(new_df)

day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        9.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          NaN        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [30]:
df = pd.read_excel("data\\missing_data3.xlsx")
df

         day temperature windspeed  event
0 2017-01-01        32 F     6 mph   Rain
1 2017-01-02      -99999     9 mph  Sunny
2 2017-01-03          28    -88888   Snow
3 2017-01-04      -99999         7      0
4 2017-01-05          32    -88888   Rain
5 2017-01-06          31         2  Sunny
6 2017-01-06          34         5      0

In [31]:
# replacing based on regex
new_df = df.replace('[A-Za-z]', '', regex=True)
new_df

         day temperature windspeed event
0 2017-01-01         32         6
1 2017-01-02      -99999        9
2 2017-01-03          28    -88888
3 2017-01-04      -99999         7     0
4 2017-01-05          32    -88888
5 2017-01-06          31         2
6 2017-01-06          34         5     0

In [32]:
# replacing based on regex
new_df = df.replace({
    'temperature' : '[A-Za-z]',
    'windspeed' : '[A-Za-z]',
}, '', regex=True)
new_df

         day temperature windspeed  event
0 2017-01-01         32         6    Rain
1 2017-01-02      -99999        9   Sunny
2 2017-01-03          28    -88888   Snow
3 2017-01-04      -99999         7      0
4 2017-01-05          32    -88888   Rain
5 2017-01-06          31         2  Sunny
6 2017-01-06          34         5      0

In [33]:
df = pd.DataFrame({
    'name': ['Robi', 'Kobi', 'Sami', 'Lotif'],
    'score': ['bad', 'good', 'exelent', 'good'],
})
df

    name    score
0   Robi      bad
1   Kobi     good
2   Sami  exelent
3  Lotif     good

In [34]:
df.replace(['bad', 'good', 'exelent'], [0, 1, 2])

    name  score
0   Robi      0
1   Kobi      1
2   Sami      2
3  Lotif      1

In [35]:
# Duplicate Value
print(df.duplicated()) # Returns True for every row that is a duplicate
new_df = df.drop_duplicates()
new_df

0    False
1    False
2    False
3    False
dtype: bool

    name    score
0   Robi      bad
1   Kobi     good
2   Sami  exelent
3  Lotif     good